ka2_2024/src/DataProcessors/ПомощникПереходаНаЕНС/ПомощникПереходаНаЕНС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПомощникПереходаНаЕНС</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПерехода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

ka2_2024/src/Enums/ВидыОперацийПоЕдиномуНалоговомуСчету/ВидыОперацийПоЕдиномуНалоговомуСчету.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийПоЕдиномуНалоговомуСчету</name>
  <enumValues>
    <name>НачислениеНалогов</name>
  </enumValues>
  <enumValues>
    <name>УплатаНалогов</name>
  </enumValues>
  <enumValues>
    <name>НачислениеПенейШтрафов</name>
  </enumValues>
  <enumValues>
    <name>ПогашениеПенейШтрафов</name>
  </enumValues>
  <enumValues>
    <name>КорректировкаСчета</name>
  </enumValues>
</mdclass:Enum>

ka2_2024/src/Enums/ТипыРегламентныхОпераций/ТипыРегламентныхОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыРегламентныхОпераций</name>
  <enumValues>
    <name>ЗакрытиеГода</name>
  </enumValues>
  <enumValues>
    <name>РасчетКурсовыхРазниц</name>
    <comment>Переоценка по плану счетов</comment>
  </enumValues>
  <enumValues>
    <name>РасчетДолейСписанияКосвенныхРасходов</name>
  </enumValues>
  <enumValues>
    <name>РасчетЗемельногоНалога</name>
  </enumValues>
  <enumValues>
    <name>РасчетНалогаНаИмущество</name>
  </enumValues>
  <enumValues>
    <name>РасчетНалогаНаПрибыль</name>
  </enumValues>
  <enumValues>
    <name>РасчетОтложенногоНалога</name>
  </enumValues>
  <enumValues>
    <name>РасчетТорговогоСбора</name>
  </enumValues>
  <enumValues>
    <name>РасчетТранспортногоНалога</name>
  </enumValues>
  <enumValues>
    <name>СписаниеКосвенныхРасходов</name>
    <comment>Списание косвенных расходов в части нормируемых</comment>
  </enumValues>
  <enumValues>
    <name>ФормированиеРезервовПоСомнительнымДолгам</name>
  </enumValues>
  <enumValues>
    <name>ПризнаниеРасходовПриУСН</name>
  </enumValues>
  <enumValues>
    <name>РасчетНалогаУСН</name>
  </enumValues>
  <enumValues>
    <name>ПризнаниеВНУАрендныхПлатежей</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеФинансовогоРезультата</name>
  </enumValues>
  <enumValues>
    <name>ПереоценкаСуммыВВалютеФинОтчетности</name>
  </enumValues>
  <enumValues>
    <name>СписаниеУбытковПрошлыхЛет</name>
  </enumValues>
  <enumValues>
    <name>РеклассификацияДолгосрочныхАктивовОбязательств</name>
  </enumValues>
  <enumValues>
    <name>РасчетЕНС</name>
  </enumValues>
  <enumValues>
    <name>КорректировкаНалоговойБазыПоКурсовымРазницам</name>
  </enumValues>
</mdclass:Enum>

ka2_2024/src/Documents/РегламентнаяОперация/РегламентнаяОперация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РегламентнаяОперация</name>
  <registerRecords>InformationRegister.РасчетНалогаНаИмущество</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыПоНалогамНаЕдиномНалоговомСчете</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыПоФинансовымИнструментамНУ</registerRecords>
  <registerRecords>InformationRegister.РасчетСтавкиНалогаНаПрибыльЗаМесяц</registerRecords>
  <registerRecords>AccumulationRegister.КнигаУчетаДоходовИРасходовРаздел2</registerRecords>
  <registerRecords>InformationRegister.РасчетНалогаНаИмуществоПоКадастровойСтоимости</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеРасходы</registerRecords>
  <registerRecords>InformationRegister.РасчетРезервовПоСомнительнымДолгам</registerRecords>
  <registerRecords>InformationRegister.РасчетРазницВОценкеАктивовИОбязательств</registerRecords>
  <registerRecords>AccumulationRegister.ПартииПрочихРасходов</registerRecords>
  <registerRecords>InformationRegister.РасчетДолейБазыНалогаНаПрибыль</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеАктивыПассивы</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияПоПрочимАктивамПассивам</registerRecords>
  <registerRecords>InformationRegister.ОтражениеДокументовВРеглУчете</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияДоходыРасходыПрочиеАктивыПассивы</registerRecords>
  <registerRecords>AccumulationRegister.УплатаНДФЛНалоговымиАгентамиКРаспределению</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСФондамиПоСтраховымВзносам</registerRecords>
  <registerRecords>InformationRegister.РасчетЗемельногоНалога</registerRecords>
  <registerRecords>AccumulationRegister.РасходыПриУСНОСиНМА</registerRecords>
  <registerRecords>AccumulationRegister.НДФЛПеречисленный</registerRecords>
  <registerRecords>AccumulationRegister.РасходыПриУСНМатериалы</registerRecords>
  <registerRecords>AccumulationRegister.РасходыПриУСН</registerRecords>
  <registerRecords>InformationRegister.РасчетНормированияРасходов</registerRecords>
  <registerRecords>InformationRegister.РасчетНалогаУСН</registerRecords>
  <registerRecords>InformationRegister.РасчетДолейБазыНалогаНаПрибыльПоВариантамНалогообложения</registerRecords>
  <registerRecords>AccumulationRegister.НДФЛКПеречислению</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>InformationRegister.РасчетОтложенногоНалога</registerRecords>
  <registerRecords>InformationRegister.РасчетРасходовПоАренде</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПоставщикамиНУ</registerRecords>
  <registerRecords>InformationRegister.РасчетПоказателейОтложенногоНалога</registerRecords>
  <registerRecords>AccumulationRegister.РасходыПриУСНТовары</registerRecords>
  <registerRecords>InformationRegister.ПримененныеСтавкиОтложенногоНалога</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыПоСанкциямНаЕдиномНалоговомСчете</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСКлиентамиНУ</registerRecords>
  <registerRecords>AccumulationRegister.КнигаУчетаДоходовИРасходов</registerRecords>
  <registerRecords>InformationRegister.РасчетСтоимостиНалоговыхАктивовИОбязательствПослеИзмененияСтавкиНалогаНаПрибыль</registerRecords>
  <registerRecords>InformationRegister.ДолиСписанияКосвенныхРасходов</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыНалоговыхАгентовСБюджетомПоНДФЛ</registerRecords>
  <registerRecords>InformationRegister.РасчетТранспортногоНалога</registerRecords>
  <registerRecords>InformationRegister.РасчетСтоимостиНалоговыхАктивовИОбязательств</registerRecords>
  <registerRecords>InformationRegister.РасчетЭффектаИзмененияСтавокНалогаНаПрибыль</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыПоЕдиномуНалоговомуСчету</registerRecords>
  <registerRecords>InformationRegister.РасчетНалогаНаИмуществоПоСреднегодовойСтоимости</registerRecords>
  <registerRecords>AccumulationRegister.СтоимостьОС</registerRecords>
  <attributes>
    <name>ТипОперации</name>
    <type>
      <types>EnumRef.ТипыРегламентныхОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
</mdclass:Document>

ka2_2024/src/Documents/КорректировкаРасчетовПоНалогам/КорректировкаРасчетовПоНалогам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КорректировкаРасчетовПоНалогам</name>
  <registerRecords>AccumulationRegister.РасчетыПоНалогамНаЕдиномНалоговомСчете</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеАктивыПассивы</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияПоПрочимАктивамПассивам</registerRecords>
  <registerRecords>InformationRegister.ОтражениеДокументовВРеглУчете</registerRecords>
  <registerRecords>AccumulationRegister.УплатаНДФЛНалоговымиАгентамиКРаспределению</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСФондамиПоСтраховымВзносам</registerRecords>
  <registerRecords>AccumulationRegister.НДФЛПеречисленный</registerRecords>
  <registerRecords>AccumulationRegister.НДФЛКПеречислению</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыПоСанкциямНаЕдиномНалоговомСчете</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыНалоговыхАгентовСБюджетомПоНДФЛ</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыПоЕдиномуНалоговомуСчету</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийПоЕдиномуНалоговомуСчету</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>ВводОстатковРасчетовПоЕНС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РасшифровкаНалогов</name>
    <attributes>
      <name>ТипНалога</name>
      <type>
        <types>EnumRef.ТипыНалогов</types>
      </type>
    </attributes>
    <attributes>
      <name>КодБК</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокУплаты</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчета</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто1</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто2</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто3</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлатежныйДокумент</name>
      <type>
        <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
        <types>DocumentRef.ОперацияБух</types>
        <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДвижения</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидПлатежа</name>
      <type>
        <types>EnumRef.ВидыПлатежейВГосБюджет</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ka2_2024/src/DataProcessors/ПомощникПереходаНаЕНС/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Переносит расчеты по налогам с помощью документов Корректировка расчета по налогам
//
// Параметры:
//	СтруктураПараметров - Структура - параметры обработки
//	АдресХранилища - УникальныйИдентификатор - адрес временного хранилища
//	
Процедура ПереносРасчетовПоНалогамВзносам(СтруктураПараметров, АдресХранилища) Экспорт
	
	Отказ = Ложь;
	
	ДокОбъект = ПодготовитьДокументКорректировки(СтруктураПараметров);
	
	ПараметрыДокумента = Новый Структура();
	ПараметрыДокумента.Вставить("Организация",         ДокОбъект.Организация);
	ПараметрыДокумента.Вставить("Дата",                ДокОбъект.Дата);
	ПараметрыДокумента.Вставить("ВидОперации",         СтруктураПараметров.ВидОперации);
	ПараметрыДокумента.Вставить("ВводОстатковРасчетовПоЕНС", Истина);
	
	// получаем данные для заполнения документа
	ТаблицаОстатков = ПолучитьОстаткиРасчетов(ПараметрыДокумента);
	
	ДокОбъект.РасшифровкаНалогов.Очистить();
	Для Каждого СтрокаТаблицы Из ТаблицаОстатков Цикл
		НоваяСтрока = ДокОбъект.РасшифровкаНалогов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
	КонецЦикла;
	
	ТребуетсяКонтроль = ЗаписатьДокументКорректировки(ДокОбъект);
	
	СозданныеДокументы = Новый Массив;
	СозданныеДокументы.Добавить(ДокОбъект.Ссылка);
	
	Результат = Новый Структура;
	Результат.Вставить("ВыполняемаяОперация", СтруктураПараметров.ВидОперации);
	Результат.Вставить("ДокументыОперации",   СозданныеДокументы);
	Результат.Вставить("УспешноВыполнено",    НЕ Отказ);
	Результат.Вставить("ТребуетсяКонтроль",   ТребуетсяКонтроль);
	
	ПоместитьВоВременноеХранилище(Результат, АдресХранилища);

КонецПроцедуры

// Распределяет авансы по налогам и санкциям, создает документы Корректировка расчетов по налогам
//
// Параметры:
//	СтруктураПараметров - Структура - параметры обработки
//	АдресХранилища - УникальныйИдентификатор - адрес временного хранилища
//	
Процедура ЗачетАвансов(СтруктураПараметров, АдресХранилища) Экспорт
	
	Отказ = Ложь;
	
	ДокументКорректировка = ПодготовитьДокументКорректировки(СтруктураПараметров);
	СтруктураПараметров.ВидОперации = Перечисления.ВидыОперацийПоЕдиномуНалоговомуСчету.ПогашениеПенейШтрафов;
	ДокументКорректировкаСанкций = ПодготовитьДокументКорректировки(СтруктураПараметров);
	
	ТаблицаРеквизиты = Новый ТаблицаЗначений;
	ТаблицаРеквизиты.Колонки.Добавить("Организация",       Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблицаРеквизиты.Колонки.Добавить("Период",            Новый ОписаниеТипов("Дата", Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	ТаблицаРеквизиты.Колонки.Добавить("Регистратор",       Новый ОписаниеТипов("ДокументСсылка.КорректировкаРасчетовПоНалогам"));
	ТаблицаРеквизиты.Колонки.Добавить("ВидОперации",       Новый ОписаниеТипов("ПеречислениеСсылка.ТипыРегламентныхОпераций"));
	ТаблицаРеквизиты.Колонки.Добавить("ВыдаватьСообщения", Новый ОписаниеТипов("Булево"));
	
	РеглОперация = Документы.РегламентнаяОперация.СоздатьДокумент();
	НоваяСтрока = ТаблицаРеквизиты.Добавить();
	НоваяСтрока.Организация       = СтруктураПараметров.Организация;
	НоваяСтрока.Период            = КонецДня(СтруктураПараметров.ДатаПерехода);
	НоваяСтрока.Регистратор       = РеглОперация.Ссылка;
	НоваяСтрока.ВидОперации       = Перечисления.ТипыРегламентныхОпераций.РасчетЕНС;
	НоваяСтрока.ВыдаватьСообщения = Ложь;
	
	ПараметрыПроведения = Новый Структура();
	ПараметрыПроведения.Вставить("ТаблицаРеквизиты", ТаблицаРеквизиты);
	
	ЕдиныйНалоговыйСчет.ЗачетАвансаПоЕдиномуНалоговомуСчету(ПараметрыПроведения,,РеглОперация.Движения, Отказ);
	
	Документы.КорректировкаРасчетовПоНалогам.ЗаполнитьПоДвижениямДляЗачетаАванса(ДокументКорректировка, РеглОперация.Движения);
	Документы.КорректировкаРасчетовПоНалогам.ЗаполнитьПоДвижениямДляЗачетаАванса(ДокументКорректировкаСанкций, РеглОперация.Движения);

	ТребуетсяКонтроль = ЗаписатьДокументКорректировки(ДокументКорректировка);
	ТребуетсяКонтрольСанкций = ЗаписатьДокументКорректировки(ДокументКорректировкаСанкций);
	
	СозданныеДокументы = Новый Массив;
	СозданныеДокументы.Добавить(ДокументКорректировка);
	СозданныеДокументы.Добавить(ДокументКорректировкаСанкций);
	
	Результат = Новый Структура;
	Результат.Вставить("ВыполняемаяОперация", Перечисления.ВидыОперацийПоЕдиномуНалоговомуСчету.УплатаНалогов);
	Результат.Вставить("ДокументыОперации",   СозданныеДокументы);
	Результат.Вставить("УспешноВыполнено",    НЕ Отказ);
	Результат.Вставить("ТребуетсяКонтроль",   ТребуетсяКонтроль Или ТребуетсяКонтрольСанкций);
	
	ПоместитьВоВременноеХранилище(Результат, АдресХранилища);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОтменитьВыполнениеОперацииПереходаНаЕНС(СтруктураПараметров, ФиксироватьУстаревшие = Ложь, Отказ = Ложь) Экспорт

	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	// обработаем ссылки на документы операции и сами документы в зависимости от переданных параметров:
	// Если СтруктураПараметров.СпособОбработкиДокументовОперации = "ПометитьНаУдаление" - помечаем на удаление
	// Если СтруктураПараметров.СпособОбработкиДокументовОперации = "ОтменитьПроведение" - делаем не проведенными
	ОбрабатыватьДокументыОперации = Ложь;
	СтруктураПараметров.Свойство("ОбрабатыватьДокументыОперации", ОбрабатыватьДокументыОперации);
	
	Если ОбрабатыватьДокументыОперации Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокументыОперацийПереходаНаЕНС.Ссылка КАК ДокументОперации
		|ИЗ
		|	Документ.КорректировкаРасчетовПоНалогам КАК ДокументыОперацийПереходаНаЕНС
		|ГДЕ
		|	ДокументыОперацийПереходаНаЕНС.Организация = &Организация
		|	И ДокументыОперацийПереходаНаЕНС.ВводОстатковРасчетовПоЕНС
		|	И ДокументыОперацийПереходаНаЕНС.ВидОперации = &ВидОперации";

		Запрос.УстановитьПараметр("Организация",  СтруктураПараметров.Организация);
		Запрос.УстановитьПараметр("ВидОперации",  СтруктураПараметров.ВидОперации);
		НаборДокументы = Запрос.Выполнить().Выбрать();
		
		Если НаборДокументы.Количество() > 0 Тогда
			
			Пока НаборДокументы.Следующий() Цикл
				
				ДокументОперации = НаборДокументы.ДокументОперации.ПолучитьОбъект();
				
				Если СтруктураПараметров.СпособОбработкиДокументовОперации = "ПометитьНаУдаление" Тогда
					
					ДокументОперации.УстановитьПометкуУдаления(Истина);
					
				ИначеЕсли СтруктураПараметров.СпособОбработкиДокументовОперации = "ОтменитьПроведение" Тогда
					
					Если ДокументОперации.Проведен Тогда
						ДокументОперации.Записать(РежимЗаписиДокумента.ОтменаПроведения);
					КонецЕсли; 
				КонецЕсли; 
				
			КонецЦикла; 
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьОстаткиРасчетов(ПараметрыДокумента) Экспорт
	
	Организация = ПараметрыДокумента.Организация;
	Период      = ПараметрыДокумента.Дата;
	ВидОперации = ПараметрыДокумента.ВидОперации;

	ТаблицаНалогов = Документы.КорректировкаРасчетовПоНалогам.ПолучитьОстаткиРасчетов(ПараметрыДокумента);
	
	Возврат ТаблицаНалогов;
	
КонецФункции

Функция ИмяСобытияЖурналаРегистрации() Экспорт

	Возврат НСтр("ru = 'Переход на Единый налоговый счет'", ОбщегоНазначения.КодОсновногоЯзыка());

КонецФункции // ИмяСобытияЖурналаРегистрации()

Функция ПодготовитьДокументКорректировки(СтруктураПараметров)

	ДатаДокумента = НачалоДня(СтруктураПараметров.ДатаПерехода);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДокументыОперацийПереходаНаЕНС.Ссылка КАК ДокументОперации
	|ИЗ
	|	Документ.КорректировкаРасчетовПоНалогам КАК ДокументыОперацийПереходаНаЕНС
	|ГДЕ
	|	ДокументыОперацийПереходаНаЕНС.Организация = &Организация
	|	И ДокументыОперацийПереходаНаЕНС.ВводОстатковРасчетовПоЕНС
	|	И ДокументыОперацийПереходаНаЕНС.ВидОперации = &ВидОперации"
	;
	
	Запрос.УстановитьПараметр("Организация",  СтруктураПараметров.Организация);
	Запрос.УстановитьПараметр("ДатаПерехода", СтруктураПараметров.ДатаПерехода);
	Запрос.УстановитьПараметр("ВидОперации",  СтруктураПараметров.ВидОперации);
	
	ДокОбъект = Неопределено;
	
	РезультатПоДокументам = Запрос.Выполнить();
	
	Если НЕ РезультатПоДокументам.Пустой() Тогда
		
		Выборка = РезультатПоДокументам.Выбрать();
		
		Ном = 0;
		МассивЛишнихДокументов = Новый Массив;
		
		Пока Выборка.Следующий() Цикл
			Ном = Ном + 1;
			Если Ном = 1 Тогда
				ДокОбъект = Выборка.ДокументОперации.ПолучитьОбъект();
				Если ДокОбъект.ПометкаУдаления Тогда
					ДокОбъект.УстановитьПометкуУдаления(Ложь);
				ИначеЕсли ДокОбъект.Проведен Тогда
					ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				КонецЕсли;
			Иначе
				МассивЛишнихДокументов.Добавить(Выборка.ДокументОперации);
			КонецЕсли;
		КонецЦикла;
		
		// лишние документы помечаем на удаление
		Для каждого ЛишнийДокумент Из МассивЛишнихДокументов Цикл
			ЛишнийОбъект = ЛишнийДокумент.ПолучитьОбъект();
			ЛишнийОбъект.УстановитьПометкуУдаления(Истина);
		КонецЦикла;
		
	Иначе
		ДокОбъект = Документы.КорректировкаРасчетовПоНалогам.СоздатьДокумент();
		ДокОбъект.ВидОперации         = СтруктураПараметров.ВидОперации;
		ДокОбъект.ВводОстатковРасчетовПоЕНС = Истина;
		ДокОбъект.Дата                = ДатаДокумента;
		ДокОбъект.Организация         = СтруктураПараметров.Организация;
		ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;
	
	ДокОбъект.Дата                = ДатаДокумента;
	ДокОбъект.Организация         = СтруктураПараметров.Организация;
	ДокОбъект.Ответственный       = Пользователи.ТекущийПользователь();
	ДокОбъект.ВидОперации         = СтруктураПараметров.ВидОперации;
	ДокОбъект.ВводОстатковРасчетовПоЕНС = Истина;
	ДокОбъект.Комментарий         = СтрШаблон(НСтр("ru = '#Документ создан автоматически при переходе на ЕНС, операция - ""%1""'"), СтруктураПараметров.ВидОперации);
	
	Возврат ДокОбъект;
	
КонецФункции

Функция ЗаписатьДокументКорректировки(ДокОбъект)

	ТребуетсяКонтроль = Не ДокОбъект.ПроверитьЗаполнение();
	Если ТребуетсяКонтроль Тогда
		Если ДокОбъект.Проведен Тогда
			ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		Иначе
			ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
	Иначе
		Попытка
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Если ДокОбъект.Проведен Тогда
				ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			Иначе
				ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
			ТребуетсяКонтроль = Истина;
			
			ШаблонСообщения = НСтр("ru = 'Не удалось провести документ %1
									|%2'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, ДокОбъект.Ссылка, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ЗаписьЖурналаРегистрации(
				ИмяСобытияЖурналаРегистрации(), 
				УровеньЖурналаРегистрации.Ошибка,
				Метаданные.Документы.КорректировкаРасчетовПоНалогам,, 
				ТекстСообщения);
			
		КонецПопытки;
	КонецЕсли;
	
	Возврат ТребуетсяКонтроль;

КонецФункции

#КонецОбласти

#КонецЕсли
